const btn = document.querySelector('#emoji');
const body = document.querySelector('body');
const emojis = [
    '😀', '😃', '😄', '😁', '😆', '😅', '😂', '🤣', '🥲', '😜', '😝', '🤪', 
    '😛', '😋', '😏', '🙂', '🙃', '😊', '😇', '🥰', '😍', '😘', '😗', '😚', 
    '😶‍🌫️', '😮‍💨', '😵‍💫', '😌', '😑', '🤨', '🧐', '😒', '😬', '😠', '😡', 
    '🤬', '😢', '😭', '🥺', '😥', '😓', '🥴', '😧', '😳', '🤯', '🤔', '🤥', 
    '🤭', '🤐', '🤩', '🥳', '😎', '🤠', '👻', '👽', '🤡', '💀', '☠️', '🔥', 
    '💫', '⚡', '✨', '🌟', '🌈', '🦄', '🤑', '🤤', '🤪', '🫠', '🫣', '🫥', 
    '🫡', '🫢', '🫨', '😈', '👿', '👹', '👺', '🎃', '🤖', '🦾', '🦿', '🦹', 
    '🦸', '🧙', '🧚', '🧜', '🧝', '🧛', '🧞', '🧟', '🎉', '🎊', '🎈', 
    '🎵', '🎶', '🎷', '🎸', '🥁', '📯', '🎺', '🎻', '🪕', '🥇', '🥈', '🥉', 
    '🏆', '🏅', '🎖️', '🏵️', '🎗️', '🎮', '🕹️', '🀄', '🎴', '🃏', '🧩', '🛷', 
    '🛼', '🎯', '🎲', '🎰', '🛸', '🚀', '🛳️', '⚓', '🏰', '🗿', '🗽', '⛩️', 
    '🎭', '🎪', '👀', '😴', '🧐', '🥶', '🥵', '🤒', '🤕', '😷', '🤧', '🫨'
];

btn.addEventListener("mouseover", function (event){
    let newEmoji = emojis[Math.floor(Math.random() * emojis.length)];
    btn.innerHTML = `${newEmoji}`;
    body.style.background = "white";
});

btn.addEventListener("mouseout", function(event) {
        body.style.backgroundColor = "#ccc";
});

